---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyInteger
source: html/52866af1-890b-bcf0-9d2c-626bb5e68793.htm
---
# AssetPropertyInteger Members

Adds a new connected asset attached to this asset property, if it allows it.